app/views/autors/_form.html.erb

SELECT "pics".* FROM "pics"
SELECT 1 FROM "pics" INNER JOIN "autor_pics" ON "pics"."id" = "autor_pics"."pic_id" WHERE "autor_pics"."autor_id" IS NULL AND "pics"."id" = 1 LIMIT 1
---
  	Elegi una image de la lista<br />
  <% for p in Pic.contenido.all  %>
    <div>
      <%= radio_button_tag  "autor[pic_ids][]", p.id, @autor.pics.include?(p) %>