app/views/autors/show.html.erb

<p>
	<%= image_tag @autor.pics.first.tipo + "/" + @autor.pics.first.nombrearchivo  %>
---
SELECT "pics".* FROM "pics" INNER JOIN "autor_pics" ON "pics"."id" = "autor_pics"."pic_id" WHERE "autor_pics"."autor_id" = 1 LIMIT 1