app/controllers/autors_controller.rb

  def index
    @autors = Autor.all
---
SELECT "autors".* FROM "autors"

  def show
    @autor = Autor.find(params[:id])
---
SELECT "autors".* FROM "autors" WHERE "autors"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @autor = Autor.find(params[:id])
---
SELECT "autors".* FROM "autors" WHERE "autors"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @autor = Autor.new(params[:autor])

    respond_to do |format|
      if @autor.save
---
INSERT INTO "autors" ("apellido", "created_at", "cv", "nombre", "robot", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["apellido", "schumi"], ["created_at", Fri, 02 Mar 2012 01:53:33 UTC +00:00], ["cv", "asdasdasd"], ["nombre", "Mick"], ["robot", 0], ["updated_at", Fri, 02 Mar 2012 01:53:33 UTC +00:00]]

  def update
    @autor = Autor.find(params[:id])

    respond_to do |format|
      if @autor.update_attributes(params[:autor])
---
SELECT "autors".* FROM "autors" WHERE "autors"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "autors" SET "updated_at" = '2012-03-02 02:21:20.294000', "cv" = '<h3 style="color: #000000; background-image: none; background-color: #ffffff; font-weight: bold; margin: 0px 0px 0.3em; overflow: hidden; padding-top: 0.5em; padding-bottom: 0.17em; border-bottom-style: none; width: auto; font-size: 17px; font-family: sans-serif; font-style: normal; font-variant: normal; letter-spacing: normal; line-height: 19px; orphans: 2; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px;"><span class="mw-headline">Filosof&iacute;a</span></h3>