app/controllers/pics_controller.rb

  def index
    @pics = Pic.all
---
SELECT "pics".* FROM "pics"

  def show
    @pic = Pic.find(params[:id])
---
SELECT "pics".* FROM "pics" WHERE "pics"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @pic = Pic.find(params[:id])
---
SELECT "pics".* FROM "pics" WHERE "pics"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @pic = Pic.new(params[:pic])

    respond_to do |format|
      if @pic.save
---
INSERT INTO "pics" ("created_at", "nombrearchivo", "tipo", "titulo", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 01 Mar 2012 22:57:14 UTC +00:00], ["nombrearchivo", "psicologia_montegrande.jpg"], ["tipo", "WebApp"], ["titulo", "Logo"], ["updated_at", Thu, 01 Mar 2012 22:57:14 UTC +00:00]]

  def update
    @pic = Pic.find(params[:id])

    respond_to do |format|
      if @pic.update_attributes(params[:pic])
---
SELECT "pics".* FROM "pics" WHERE "pics"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "pics" SET "updated_at" = '2012-03-01 23:42:09.812000', "titulo" = 'Freud(FotoColor)' WHERE "pics"."id" = 2